---
kind: type
id: T:Autodesk.Revit.DB.Electrical.WireConduitTypeSetIterator
source: html/d6f64a0b-6752-6df6-821d-9f8bb85f4ab3.htm
---
# Autodesk.Revit.DB.Electrical.WireConduitTypeSetIterator

An iterator to a conduit type set.

## Syntax (C#)
```csharp
public abstract class WireConduitTypeSetIterator : APIObject,
	IEnumerator
```